Repository: FelixJacobi/stsbl-iserv-scmc
Catalog: share/locale/*/scmc3.po
Languages: de

source: Login
de: Anmelden

source: Certificate Management
de: Zeugnisverwaltung

source: Currently there is no master password set. Please contact your administrator.
de: Derzeit ist das Masterpasswort nicht gesetzt. Bitte kontaktieren Sie Ihren Administrator.

source: Currently for your account is not a user password set. Please contact your administrator.
de: Derzeit ist für Ihr Konto kein Benutzerpasswort gesetzt. Bitte kontaktieren Sie Ihren Administrator.

source: Please enter both passwords, the master password and your personal user password. If you do not know them, please conact your administrator.
de: Bitte geben Sie beide Passwörter ein, das Masterpasswort und Ihr persönliches Benutzerkennwort. Wenn Sie diese nicht kennen, kontaktieren Sie bitte Ihren Administrator.

source: Set user password
de: Benutzerpasswort setzen

source: User passwords
de: Benutzerpasswörter

source: Administration
de: Verwaltung

source: Set a new user password for %s
de: Ein neues Benutzerpasswort für %s setzen

source: Back to details
de: Zurück zu Details

source: The user has currently not the privilege "Access the connector to up- and download data". Make sure that the User also have this privilege assigned. Otherwhile the certificate management will not shown in the IDesk.
de: Der Benutzer hat derzeit nicht das Sonderrecht "Auf den Connector zugreifen um Daten hoch- und herunterzuladen". Stellen Sie sicher, dass der Benutzer dieses Sonderrecht hat. Andernfalls wird der Menüpunkt Zeugnisverwaltung im IDesk nicht angezeigt.

source: Master password
de: Masterpasswort

source: Everyone who should access the certificate management section need to know this password. After you you changed the password, note it down. If you forget it, you can only reset it via the root console.
de: Jeder, der Zugriff auf den Zeugnisverwaltungsbereich haben soll, muss Kenntnis von diesem Passwort haben. Nachdem Sie das Passwort geändert haben, notieren Sie es. Sollten Sie es vergessen, können Sie es ausschließlich über die Root-Konsole zurücksetzen.

source: Currently there is no master password set. Please enter a new master password in the formular and press Update password.
de: Derzeit ist kein Masterpasswort gesetzt. Bitte geben Sie ein neues Masterpasswort in das Formular ein und drücken Sie Passwort aktualisieren.

source: Every user which should access the certificate management section needs also to have an individual user password.
de: Jeder Benutzer, der auf den Zeugnisverwaltungsbereich zugreifen soll, benötigt außerdem ein invidiuelles Benutzerpasswort.

source: Set up user passwords
de: Benutzerpasswörter einrichten

source: Servers
de: Server

source: Configure the servers which are the targets for up- and downloading.
de: Richten Sie die Server ein, welche die Ziele für das Hoch- und Herunterladen sind.

source: Set up servers
de: Server einrichten

source: Delete user password
de: Benutzerpasswort löschen

source: Delete user password of %s
de: Benutzerpasswort von %s löschen

source: Do you really want to delete the user password of %s?
de: Möchten Sie das Benutzerpasswort von %s wirklich löschen?

source: Data Download
de: Daten-Download

source: Data Upload
de: Daten-Upload

source: Before you upload new class data, make sure that you have downloaded a security copy of the results. All existing data in the Jahrgang* folder inside the /Zeugnisse/ folder on the certificate management server will deleted.
de: Bevor Sie neue Klassendaten hochladen, stellen Sie sicher, dass Sie eine Sicherungskopie der Ergebnisse heruntergeladen haben. Alle existierenden Jahrgang*-Ordnern innerhalb des /Zeugnisse/-Ordners auf dem Zeugnisverwaltungsserver werden gelöscht.

source: Start Page
de: Startseite

source: Download entered certificate data from the server.
de: Eingebene Zeugnisdaten vom Server herunterladen.

source: Download certifcate data
de: Zeugnisdaten herunterladen

source: Upload new class and course lists to the server.
de: Neue Klassen- und Kurslisten auf den Server hochladen

source: Upload certifcate data
de: Zeugnisdaten hochladen

source: Last actions
de: Letzte Aktionen

source: Date
de: Datum

source: Action
de: Aktion

source: Something went wrong.
de: Etwas ist schiefgelaufen.

source: You have to upload a zip file!
de: Sie müssen eine ZIP-Datei hochladen!

source: School Certificate Manager
de: Zeugnisverwalter

source: School Certificate Manager Connector
de: Zeugnisverwaltungsconnector

source: Manage master password and servers
de: Masterpasswort und Server verwalten

source: Access the connector to up- and download data
de: Auf den Connector zugreifen um Daten hoch- und herunterzuladen

source: Choose a valid server type.
de: Wählen Sie einen gültigen Server-Typ.

source: Enter a valid domain.
de: Geben Sie eine gültige Domain an.

source: Enter a valid Unix account name.
de: Geben Sie einen gültigen Unix-Kontonamen an.

source: Reset master password
de: Masterpasswort zurücksetzen

source: Exit
de: Beenden

source: School Type
de: Schultyp

source: Module: School Certificate Manager Connector
de: Modul: Zeugnisverwaltungsconnector

source: Are you sure that you want to reset the master password? (y/N)
de: Möchten Sie das Masterpasswort wirklich zurücksetzen? (y/N)

source: Deleting master password ...
de: Lösche Masterpasswort ...

source: Running iservchk scmc ...
de: Führe iservchk scmc aus ...

source: Success, you may now set the master password in the IDesk under
de: Erfolg, Sie sollten das Masterpasswort jetzt im IDesk unter

source: Administration > Modules > Certifcate Management
de: Verwaltung > Module > Zeugnisverwaltung

source: again.
de: erneut setzen.

source: Press enter to continue ...
de: Eingabetaste zum Fortfahren drücken ...

source: Year %s
de: Jahrgang %s

source: Select destination server
de: Zielserver wählen

source: If your administrator has configured multiple servers (for example a primary and backup server), you can select the destination server.
de: Wenn Ihr Administrator mehrere Server konfiguriert hat (zum Beispiel einen primären und einen Sicherungs-Server), können Sie einen Zielserver wählen.

source: Zip file with class data
de: ZIP-Datei mit Klassendaten

source: Please select a file to upload.
de: Bitte wählen Sie eine Datei zum Hochladen aus.

source: The zip file with the class data. It must contain sub folders with the class lists sorted by age group (Jahrgang5, Jahrgang6, ...). For more information please refer the WZeugnis Documentation.
de: Die ZIP-Datei mit den Klassendaten. Sie muss Unterordner mit den Klassenlisten enthalten, sortiert nach Jahrgang (Jahrgang5, Jahrgang6, ...). Für mehr Informationen schauen Sie bitte in die WZeugnis-Dokumentation.

source: Limit upload to these years
de: Upload auf diese Jahrgänge beschränken

source: You can limit the upload to particular years. Only the course lists of the selected years will deleted and replaced on the server.
de: Sie können den Upload auf bestimmte Jahrgänge beschränken. Nur die Kurslisten der gewählten Jahrgänge werden auf dem Server gelöscht und ersetzt.

source: Confirmation
de: Bestätigung

source: You need to confirm that a new upload will delete all existing data on the server.
de: Sie müssen bestätigen, dass ein neuer Upload alle existierenden Daten auf dem Server löscht.

source: Before you can upload new class data, you have to confirm that will lead to loosing all data currently stored on the certificate server.
de: Bevor Sie neue Klassendaten hochladen, müssen Sie bestätigen, dass ein neuer Upload alle existierenden gespeicherten Daten auf dem Server löscht.

source: Upload data
de: Daten hochladen

source: Limit download to these years
de: Download auf diese Jahrgänge beschränken

source: You can limit the download to particular years. Only the selected years will be included in the Zip file.
de: Sie können den Download auf einzelne Jahrgänge beschränken. Nur die ausgewählten Jahrgänge werden in der ZIP-Datei enthalten sein.

source: Download data
de: Daten herunterladen

source: The master password is wrong.
de: Das Masterpasswort ist falsch.

source: The user password is wrong.
de: Das Benutzerpasswort ist falsch.

source: You have logged in successfully in the Certificate Management Section.
de: Sie haben sich erfolgreich im Zeugnisverwaltungsbereich angemeldet.

source: You have logged out successfully from the Certificate Management Section.
de: Sie haben sich erfolgreich aus dem Zeugnisverwaltungsbereich abgemeldet.

source: Please enter the master password and try it again.
de: Bitte geben Sie das Masterpasswort ein und versuchen Sie es erneut.

source: Please enter the user password and try it again.
de: Bitte geben Sie das Benutzerpasswort ein und probieren Sie es erneut.

source: User password
de: Benutzerpasswort

source: New password and repeat does not match.
de: Neues Passwort und Wiederholung stimmen nicht überein.

source: Master password updated successfully.
de: Masterpasswort erfolgreich aktualisiert.

source: Old master password is wrong.
de: Das alte Masterpasswort ist falsch.

source: This should never happen.
de: Das sollte nicht vorkommen.

source: Old master password can not be empty.
de: Altes Masterpasswort darf nicht leer sein.

source: Old master password
de: Altes Masterpasswort

source: New master password can not be empty.
de: Neues Masspasswort darf nicht leer sein.

source: New master password
de: Neues Masterpasswort

source: Repeat of new master password can not be empty.
de: Wiederholung des neues Masterpasswortes darf nicht leer sein.

source: Repeat new master password
de: Neues Masterpasswort wiederholen

source: Update password
de: Passwort aktualisieren

source: New user password
de: Neues Benutzerpasswort

source: User password can not be empty.
de: Benutzerpasswort darf nicht leer sein.

source: Cancel
de: Abbrechen

source: User password of %s set.
de: Benutzerpasswort von %s gesetzt.

source: Yes
de: Ja

source: No
de: Nein

source: User password of %s deleted.
de: Benutzerpasswort von %s gelöscht.

source: Logout
de: Abmelden

source: The entered domain must not be equivalent with the domain of the portal server.
de: Die eingebene Domain darf nicht der Domain des Portalservers entsprechen.

source: The entered domain must not be equivalent with the host name of the portal server.
de: Die eingebene Domain darf nicht dem Hostnamen des Portalservers entsprechen.

source: The entered domain must not use the WWW group homepage.
de: Die eingebene Domain darf nicht die WWW-Gruppenhomepage benutzten.

source: The entered domain must not be one of the alias domains.
de: Die eingebene Domain darf keine der Alias-Domains sein.

source: User
de: Benutzer

source: Firstname
de: Vorname

source: Lastname
de: Nachname

source: Groups
de: Gruppen

source: Host
de: Gerät

source: Select the host which should be the target for up- and downloading.
de: Wählen Sie das Gerät, auf das die Daten hoch- und heruntergeladen werden soll.

source: The version of Tomcat server which is running on the certificate management server.
de: Die Version des Tomcat-Servers, die auf dem Zeugnisverwaltungsserver läuft.

source: The domain, under which the reverse proxy is reachable. Must be different from the main domain or an alias domain of the portal server.
de: Die Domain, unter der der Reverse-Proxy erreichbar ist. Diese muss sich von der Haupt-Domain oder einer Alias-Domain des Portalservers unterscheiden.

source: Assigned group
de: Zugewiesene Gruppe

source: By default a link to the reverse proxy is shown to all users with the privilege "Show link to certificate management". You can limit the visibility of the link to one group.
de: Standardmäßig wird ein Link auf den Reverse-Proxy allen Benutzern mit dem Recht "Link zur Zeugnisverwaltung anzeigen" angezeigt. Sie können die Sichtbarkeit des Links auf eine Gruppe beschränken.

source: SSH account
de: SSH-Konto

source: The account which is used to up- and download the data. The account must be member of the tomcat6/7/8 group on the certificate management server. You must upload a SSH key for this user in the server overview.
de: Das Konto, welches genutzt wird, um die Daten hoch- und herunterzuladen. Das Konto muss Mitglied der tomcat6/7/8-Gruppe auf dem Zeugnisverwaltungsserver sein. Sie müssen eine SSH-Schlüssel für diesen Benutzer in der Server-Übersicht hochladen.

source: SSH key
de: SSH-Schlüssel

source: Please select a SSH key file.
de: Bitte wählen Sie eine SSH-Schlüsseldatei.

source: Upload SSH key
de: SSH-Schlüssel hochladen

source: You must select a SSH key for uploading.
de: Sie müssen einen SSH-Schlüssel für das Hochladen auswählen

source: Uploaded new SSH key for %s.
de: Neuen SSH-Schlüssel für %s hochgeladen.

source: Delete SSH key
de: SSH-Schlüssel löschen

source: Deleted SSH key for %s.
de: SSH-Schlüssel für %s gelöscht.
